Repository: mariobl/rpm
Catalog: doc/po4a/po-rpmgraph8/*.po
Languages: pl

source: 30 June 2002
pl: 30 czerwca 2002

source: NAME
pl: NAZWA

source: rpmgraph - Display RPM Package Dependency Graph
pl: rpmgraph - Wyświetlanie grafu zależności pakietu RPM

source: SYNOPSIS
pl: SKŁADNIA

source: B<rpmgraph> I<PACKAGE_FILE>I< ...>
pl: B<rpmgraph> I<PLIK_PAKIETU>I< …>

source: DESCRIPTION
pl: OPIS

source: B<rpmgraph> uses I<PACKAGE_FILE> arguments to generate a package dependency graph. Each I<PACKAGE_FILE> argument is read and added to an rpm transaction set. The elements of the transaction set are partially ordered using a topological sort. The partially ordered elements are then printed to standard output.
pl: B<rpmgraph> używa argumentów I<PLIK_PAKIETU> do wygenerowaniagrafu zależności pakietów. Każdy argument I<PLIK_PAKIETU> jestczytany i dodawany do zbioru transakcji rpm-a. Elementy zbiorutransakcji są częściowo porządkowane przy użyciu sortowaniatopologicznego. Następnie częściowo uporządkowane elementy sąwypisywane na standardowe wyjście.

source: Nodes in the dependency graph are package names, and edges in the directed graph point to the parent of each node. The parent node is defined as the last predecessor of a package when partially ordered using the package dependencies as a relation. That means that the parent of a given package is the package's last prerequisite.
pl: Wierzchołki w grafie zależności to nazwy pakietów, krawędzie w grafieskierowanym wskazują na rodzica każdego wierzchołka. Rodzic jestzdefiniowany jako ostatni poprzednik pakietu w częściowym porządkuprzy użyciu gdzie zależności pakietu jako relacji. Oznacza to, żerodzic danego pakietu jest ostatnią zależnością pakietu.

source: The output is in B<dot>(1) directed graph format, and can be displayed or printed using the B<dotty> graph editor from the B<graphviz> package. There are no B<rpmgraph> specific options, only common B<rpm> options. See the B<rpmgraph> usage message for what is currently implemented.
pl: Wyjście jest w formacie grafu skierowanego B<dot>(1) i może byćwyświetlone lub wydrukowane przy użyciu edytora grafów B<dotty>z pakietu B<graphviz>.Nie ma opcji specyficznych dla programu B<rpmgraph>, tylko wspólneopcje B<rpm>-a. Aktualnie zaimplementowane opcje można zobaczyćw komunikacie o składni komendy B<rpmgraph>.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHORS
pl: AUTORZY
