Repository: mariobl/rpm
Catalog: doc/po4a/po-gendiff1/*.po
Languages: pl

source: Mon Jan 10 2000
pl: 10 stycznia 2000

source: NAME
pl: NAZWA

source: gendiff - utility to aid in error-free diff file generation
pl: gendiff - narzędzie pomagające przy generowaniu bezbłędnych plików diff

source: SYNOPSIS
pl: SKŁADNIA

source: B<gendiff> E<lt>directoryE<gt> E<lt>diff-extensionE<gt>
pl: B<gendiff> E<lt>katalogE<gt> E<lt>rozszerzenie-diffE<gt>

source: DESCRIPTION
pl: OPIS

source: B<gendiff> is a rather simple script which aids in generating a diff file from a single directory. It takes a directory name and a "diff-extension" as its only arguments. The diff extension should be a unique sequence of characters added to the end of all original, unmodified files. The output of the program is a diff file which may be applied with the B<patch> program to recreate the changes.
pl: B<gendiff> jest dość prostym skryptem pomagającym przy generowaniupliku diff z pojedynczego katalogu. Jako jedyne argumenty przyjmuje nazwękatalogu i "rozszerzenie-diff". Rozszerzenie diff powinno być unikalnąsekwencją znaków dodaną na końcu wszystkich oryginalnych, niezmodyfikowanych plików. Wyjściem programu jest plik diff, który możnanałożyć przy użyciu programu B<patch>, aby odtworzyć zmiany.

source: The usual sequence of events for creating a diff is to create two identical directories, make changes in one directory, and then use the B<diff> utility to create a list of differences between the two. Using gendiff eliminates the need for the extra, original and unmodified directory copy. Instead, only the individual files that are modified need to be saved.
pl: Zwykle sekwencja czynności do stworzenia pliku diff to utworzenie dwóchidentycznych katalogów, dokonanie zmian w jednym katalogu i użycienarzędzia B<diff> do utworzenia listy różnic między nimi.Użycie gendiff eliminuje potrzebę dodatkowej kopii oryginalnego, niezmodyfikowanego katalogu. Zamiast tego trzeba zachować tylko pojedynczepliki przed zmodyfikowaniem.

source: Before editing a file, copy the file, appending the extension you have chosen to the filename. I.e. if you were going to edit somefile.cpp and have chosen the extension "fix", copy it to somefile.cpp.fix before editing it. Then edit the first copy (somefile.cpp).
pl: Przed edycją pliku skopiuj go, dołączając do nazwy wybrane rozszerzenie.Tzn. jeśli zamierzasz zmodyfikować plik somefile.cpp i wybrałeś rozszerzenie"fix", skopiuj go do somefile.cpp.fix przed edycją. Następnie modyfikujpierwszą kopię (somefile.cpp).

source: After editing all the files you need to edit in this fashion, enter the directory one level above where your source code resides, and then type
pl: Po edycji wszystkich potrzebnych plików w ten sposób wejdź do katalogujeden poziom wyżej niż jest obecny kod źródłowy i napisz:

source: $ gendiff somedirectory .fix E<gt> mydiff-fix.patch
pl: $ gendiff tenkatalog .fix E<gt> mydiff-fix.patch

source: You should redirect the output to a file (as illustrated) unless you want to see the results on stdout.
pl: Powinieneś przekierować wyjście do pliku (jak na przykładzie), chyba żechcesz zobaczyć wynik na standardowym wyjściu.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHOR
pl: AUTOR
